### **Nigerian Car Price Dataset**

#### In this Assignment, we're working with the Nigerian Car Price Dataset
#### -*What is the most expensive Automatic car (show car name and model make) with a mileage of less than 50000*
#### -*Write a function to bring out the average of each car, which car make has the highest average price? Write a code to show this*
#### -*Select the row with a price at the 76th percentile score*

In [1]:
#importing the needed modules
import pandas as pd 
import numpy as np

In [2]:
# Reading the Nigerian_Car_Prices dataset
car_prices = pd.read_csv("Nigerian_Car_Prices.csv", index_col=0) # Index-_col=0 is used to remove the column called 'unnamed' 
car_prices.head()

,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,"3,120,000",NaN
1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,"5,834,000",NaN
2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,"3,640,000",NaN
3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,"3,594,000",NaN
4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,"8,410,000",NaN

In [3]:
# checking the shape of the dataset
car_prices.shape

(4095, 9)

In [4]:
# checking the column the label
car_prices.columns

Index(['Make', 'Year of manufacture', 'Condition', 'Mileage', 'Engine Size',
       'Fuel', 'Transmission', 'Price', 'Build'],
      dtype='object')

In [5]:
# checking the coulmns datatypes 
car_prices.dtypes

Make                    object
Year of manufacture    float64
Condition               object
Mileage                float64
Engine Size            float64
Fuel                    object
Transmission            object
Price                   object
Build                   object
dtype: object

In [6]:
# checking if there are missing values. And there are indeed a lot of missing values, but for the sake of the question,
# we're not going to fill them
car_prices.isna().sum()

Make                      0
Year of manufacture     478
Condition               479
Mileage                  71
Engine Size             511
Fuel                    488
Transmission             20
Price                     0
Build                  2968
dtype: int64

In [7]:
# Removing comma from the values in the Price column
car_prices['Price'] = car_prices['Price'].str.replace(',','')
car_prices['Price'].head()

0    3120000
1    5834000
2    3640000
3    3594000
4    8410000
Name: Price, dtype: object

In [8]:
# converting the dtype of Price column from object to float
car_prices["Price"] = car_prices["Price"].astype(float)

In [9]:
car_prices.dtypes

Make                    object
Year of manufacture    float64
Condition               object
Mileage                float64
Engine Size            float64
Fuel                    object
Transmission            object
Price                  float64
Build                   object
dtype: object

In [10]:
car_prices.head()

,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,3120000.0,NaN
1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,5834000.0,NaN
2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,3640000.0,NaN
3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,3594000.0,NaN
4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,8410000.0,NaN

In [13]:
car_prices['Make'].value_counts()

Toyota           1469
Lexus             464
Mercedes-Benz     436
Honda             428
Ford              197
Hyundai           179
Nissan            173
Kia                90
Land Rover         74
Volkswagen         64
Mazda              63
BMW                63
Acura              56
Infiniti           41
Chevrolet          40
Peugeot            36
Mitsubishi         23
Pontiac            22
Volvo              22
Suzuki             21
Dodge              17
Audi               14
Opel               12
Jaguar             11
Jeep               11
Porsche             9
Renault             8
Chrysler            7
Fiat                6
GMC                 5
Changan             4
Lincoln             4
Skoda               3
Hummer              2
Buick               2
JAC                 2
Citroen             2
Isuzu               2
Mini                2
MG                  2
Rover               1
Bentley             1
Seat                1
SsangYong           1
Cadillac            1
Saturn              1
Tata                1
Foton               1
Daihatsu            1
Name: Make, dtype: int64

In [15]:
car_prices['Year of manufacture'].value_counts()

2007.0    436
2008.0    364
2006.0    279
2009.0    277
2010.0    277
2004.0    246
2005.0    236
2011.0    215
2003.0    184
2013.0    182
2012.0    181
2014.0    144
2002.0    132
2015.0     93
2001.0     85
2000.0     56
2016.0     53
1999.0     43
2017.0     39
2018.0     26
1998.0     19
1997.0     13
2020.0     12
2019.0     10
1995.0      5
1996.0      4
2021.0      3
1992.0      2
1994.0      1
Name: Year of manufacture, dtype: int64

In [17]:
car_prices['Condition'].value_counts()

Nigerian Used    2521
Foreign Used     1090
Brand New           5
Name: Condition, dtype: int64

In [18]:
car_prices['Mileage'].value_counts()

299999.0    10
1.0          6
95321.0      4
482800.0     4
126.0        3
            ..
340782.0     1
392106.0     1
232306.0     1
155367.0     1
235184.0     1
Name: Mileage, Length: 3118, dtype: int64

In [19]:
car_prices['Engine Size'].value_counts()

3500.0      820
2400.0      520
1800.0      437
3000.0      306
2500.0      256
           ...
42000.0       1
371000.0      1
36.0          1
33000.0       1
184421.0      1
Name: Engine Size, Length: 81, dtype: int64

In [20]:
car_prices['Fuel'].value_counts()

Petrol      3535
Diesel        37
Hybrid        30
Electric       5
Name: Fuel, dtype: int64

In [21]:
car_prices['Transmission'].value_counts()

Automatic    3810
Manual        230
CVT            22
AMT            13
Name: Transmission, dtype: int64

In [22]:
car_prices['Price'].value_counts()

2625000.0     113
1575000.0     109
2100000.0     108
3150000.0      92
3675000.0      69
             ...
1410000.0       1
1938000.0       1
3095000.0       1
32550000.0      1
2643750.0       1
Name: Price, Length: 579, dtype: int64

In [23]:
car_prices['Build'].value_counts()

SUV    1127
Name: Build, dtype: int64

Cleaning all the columns

In [24]:
car_prices.head()

,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,3120000.0,NaN
1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,5834000.0,NaN
2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,3640000.0,NaN
3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,3594000.0,NaN
4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,8410000.0,NaN

In [26]:
car_prices['Make'].isnull().sum()

0

In [27]:
car_prices['Year of manufacture'].isnull().sum()

478

In [31]:
car_prices['Condition'].isnull().sum()

479

In [32]:
car_prices['Mileage'].isnull().sum()

71

In [33]:
car_prices['Engine Size'].isnull().sum()

511

In [34]:
car_prices['Fuel'].isnull().sum()

488

In [35]:
car_prices['Transmission'].isnull().sum()

20

In [36]:
car_prices['Price'].isnull().sum()

0

In [37]:
car_prices['Build'].isnull().sum()

2968

In [38]:
car_prices['Year of manufacture'] = car_prices['Year of manufacture'].fillna('2007.0')
car_prices['Condition'] = car_prices['Condition'].fillna('Nigerian Used')
car_prices['Mileage'] = car_prices['Mileage'].fillna(car_prices['Mileage'].mean())
car_prices['Engine Size'] = car_prices['Engine Size'].fillna(car_prices['Engine Size'].mean())
car_prices['Fuel'] = car_prices['Fuel'].fillna(car_prices['Fuel'].mode()[0])
car_prices['Transmission'] = car_prices['Transmission'].fillna(car_prices['Transmission'].mode()[0])
car_prices['Build'] = car_prices['Build'].fillna('SUV')

In [41]:
car_prices.isnull().sum()

Make                   0
Year of manufacture    0
Condition              0
Mileage                0
Engine Size            0
Fuel                   0
Transmission           0
Price                  0
Build                  0
dtype: int64

In [42]:
# Describing the dataset to have more insight
car_prices.describe()

            Mileage    Engine Size         Price
count  4.095000e+03    4095.000000  4.095000e+03
mean   1.825337e+05    3274.976562  4.271288e+06
std    2.090863e+05    7197.353858  4.900064e+06
min    1.000000e+00       3.000000  4.580000e+05
25%    1.025985e+05    2400.000000  1.872000e+06
50%    1.637560e+05    3000.000000  2.940000e+06
75%    2.306370e+05    3500.000000  4.725000e+06
max    9.976050e+06  371000.000000  5.880000e+07

**Q1: What is the most expensive Automatic car (show car name and model make) with a mileage of less than 50000**

In [72]:
car_prices.groupby(['Make','Build'])[['Make','Build','Price']].max().max()

Make          Volvo
Build           SUV
Price    58800000.0
dtype: object

**Q2: Write a function to bring out the average of each car, which car make has the highest average price? Write a code to show this**

In [74]:
# Average Of Each Car
car_prices.groupby(['Make'])['Price'].mean()

Make
Acura            3.414470e+06
Audi             6.090536e+06
BMW              3.785456e+06
Bentley          1.689500e+07
Buick            4.770000e+06
Cadillac         6.730000e+06
Changan          1.222500e+07
Chevrolet        4.473020e+06
Chrysler         2.797500e+06
Citroen          1.260000e+06
Daihatsu         9.450000e+05
Dodge            4.898382e+06
Fiat             6.945000e+06
Ford             3.711745e+06
Foton            4.938000e+06
GMC              8.784600e+06
Honda            2.527255e+06
Hummer           6.300000e+06
Hyundai          3.873316e+06
Infiniti         2.997098e+06
Isuzu            2.048400e+06
JAC              7.290000e+06
Jaguar           4.330682e+06
Jeep             9.580545e+06
Kia              3.511190e+06
Land Rover       1.021207e+07
Lexus            5.032669e+06
Lincoln          7.601000e+06
MG               1.575000e+06
Mazda            2.760742e+06
Mercedes-Benz    6.270841e+06
Mini             6.300000e+06
Mitsubishi       1.920609e+06
Nissan           3.941813e+06
Opel             1.462500e+06
Peugeot          1.704417e+06
Pontiac          2.536636e+06
Porsche          7.655889e+06
Renault          1.561562e+06
Rover            1.018500e+07
Saturn           3.150000e+06
Seat             2.520000e+06
Skoda            1.967500e+06
SsangYong        2.625000e+06
Suzuki           5.964286e+06
Tata             1.785000e+07
Toyota           4.077386e+06
Volkswagen       3.004469e+06
Volvo            2.365864e+06
Name: Price, dtype: float64

In [87]:
#car with highest average price
car_prices.groupby(['Make','Build'])['Price'].mean().reset_index().max().reset_index()

   index           0
0   Make       Volvo
1  Build         SUV
2  Price  17850000.0

**Q3: Select the row with a price at the 76th percentile score**

In [88]:
car_prices.quantile([0.76], axis=0)

        Mileage  Engine Size      Price
0.76  233935.56       3500.0  4770000.0

The 76th percentile falls at **Price of 4770,000.0**